In [5]:
import pandas as pd

In [16]:
emp = pd.read_csv(r'C:\Users\nikit\SCMS_practical_class\Python\EDA\employees.csv')

In [7]:
emp[emp['emp_no']==10010]

   emp_no  birth_date first_name last_name gender   hire_date
9   10010  1963-06-01  Duangkaew  Piveteau      F  1989-08-24

In [8]:
emp_no_list = [10010,10011]
emp[emp['emp_no'].isin(emp_no_list)]

    emp_no  birth_date first_name last_name gender   hire_date
9    10010  1963-06-01  Duangkaew  Piveteau      F  1989-08-24
10   10011  1953-11-07       Mary     Sluis      F  1990-01-22

In [9]:
emp.shape

(1000, 6)

In [10]:
emp[emp['emp_no'].isin(emp_no_list)]

    emp_no  birth_date first_name last_name gender   hire_date
9    10010  1963-06-01  Duangkaew  Piveteau      F  1989-08-24
10   10011  1953-11-07       Mary     Sluis      F  1990-01-22

In [17]:
salaries = pd.read_csv(r'C:\Users\nikit\SCMS_practical_class\Python\EDA\Salaries.csv')

In [ ]:
salaries.shape

In [ ]:

salaries[salaries['emp_no'].isin(emp_no_list)]

In [ ]:
#join with emp with salaries
salaries.merge(emp,on='emp_no')

# it can possibale there some null value #target table is  , source  table admin table
# employes table

In [13]:
titles = pd.read_csv(r'C:\Users\nikit\SCMS_practical_class\Python\EDA\titles.csv')

In [18]:
titles

     emp_no            title   from_date     to_date
0     10001  Senior Engineer  1986-06-26  9999-01-01
1     10002            Staff  1996-08-03  9999-01-01
2     10003  Senior Engineer  1995-12-03  9999-01-01
3     10004         Engineer  1986-12-01  1995-12-01
4     10004  Senior Engineer  1995-12-01  9999-01-01
..      ...              ...         ...         ...
995   10669     Senior Staff  2001-11-17  9999-01-01
996   10669            Staff  1996-11-17  2001-11-17
997   10670     Senior Staff  1993-03-23  9999-01-01
998   10670            Staff  1988-03-23  1993-03-23
999   10671     Senior Staff  2001-09-13  9999-01-01

[1000 rows x 4 columns]

In [19]:
titles[titles['emp_no'].isin(emp_no_list)]

    emp_no     title   from_date     to_date
14   10010  Engineer  1996-11-24  9999-01-01
15   10011     Staff  1990-01-22  1996-11-09

In [ ]:
# first name , salary (max ) latest salary , hire date , last working if employees present 9999 current emploe , year ex , titels
#left join it better split query